{
  "journey_steps": [
    {
      "step_number": 1,
      "step_name": "Discovering the Airline",
      "description": "The customer becomes aware of the airline service through various channels such as advertisements, word of mouth, online reviews, or travel agencies."
    },
    {
      "step_number": 2,
      "step_name": "Research",
      "description": "The customer researches the airline, gathering information about its routes, flight schedules, pricing, in-flight services, and overall reputation."
    },
    {
      "step_number": 3,
      "step_name": "Booking Comparison",
      "description": "The customer compares the airline's fares and services with those of other airlines."
    },
    {
      "step_number": 4,
      "step_name": "Decision Making",
      "description": "The customer makes a decision based on their research and comparison, weighing factors like price, flight times, amenities, and customer reviews."
    },
    {
      "step_number": 5,
      "step_name": "Booking",
      "description": "The customer books a flight, choosing their desired dates, routes, and cabin class."
    },
    {
      "step_number": 6,
      "step_name": "Pre-Flight Experience",
      "description": "The customer experiences the airline's pre-flight services, such as online check-in, seat selection, and customer support."
    },
    {
      "step_number": 7,
      "step_name": "Airline Terminal Experience",
      "description": "The customer interacts with the airline at the airport, which includes boarding pass issuance, baggage drop-off, security checks, and boarding."
    },
    {
      "step_number": 8,
      "step_name": "In-flight Experience",
      "description": "The customer experiences the airline's in-flight services, including seating, meal options, in-flight entertainment, and the cabin crew's service quality."
    },
    {
      "step_number": 9,
      "step_name": "Post-Flight Experience",
      "description": "After the flight, the customer goes through immigration and customs, baggage claim, and potentially connects to other flights if applicable."
    },
    {
      "step_number": 10,
      "step_name": "Follow-Up Interaction",
      "description": "Post-trip interaction with the airline may occur, including dealing with issues like lost luggage, flight delays, cancellations, or refunds."
    }
  ]
}