{
  "response": "json\n[\n  {\n    \"date\": \"2025-01-05\",\n    \"title\": \"Awful experience\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The customer had a very negative experience with delays and poor customer service, highlighting a lack of assistance during a stressful situation of lost luggage.\"\n  },\n  {\n    \"date\": \"2025-01-05\",\n    \"title\": \"Terrible changes to BA Executive Club\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The review reflects deep disappointment with significant changes to the loyalty program, leading the customer to reconsider their loyalty to the airline after decades of flying with them.\"\n  },\n  {\n    \"date\": \"2024-12-31\",\n    \"title\": \"The best of the best - our pilot.\",\n    \"rating\": 5,\n    \"sentimentSummary\": \"The reviewer praises the exceptional skill of the pilot during a challenging landing, showing appreciation for the professionalism despite negative sentiments towards the airline's overall service.\"\n  },\n  {\n    \"date\": \"2025-01-04\",\n    \"title\": \"Disgrace Great British Airways\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The customer experienced significant delays in service and baggage handling, expressing frustration with the lack of care shown by the staff, particularly in customer service.\"\n  },\n  {\n    \"date\": \"2024-12-16\",\n    \"title\": \"Smooth ride\",\n    \"rating\": 5,\n    \"sentimentSummary\": \"The review is very positive, highlighting the excellent assistance provided for medical needs and a smooth travel experience, indicating high satisfaction with the airline’s service.\"\n  },\n  {\n    \"date\": \"2024-06-28\",\n    \"title\": \"One of the worst airlines, ashamed its British\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The customer expresses strong dissatisfaction with the airline's handling of their honeymoon plans, citing poor communication and lack of accountability.\"\n  },\n  {\n    \"date\": \"2025-01-04\",\n    \"title\": \"BA has gone from bad to worse- even…\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The review showcases a severe decline in customer service quality, with lengthy wait times for luggage and a dismissive attitude towards customer complaints.\"\n  },\n  {\n    \"date\": \"2024-12-11\",\n    \"title\": \"Autistic son assaulted by cabin crew\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer expresses outrage over an incident involving their son, condemning the lack of response from the airline regarding a serious allegation, which points to inadequate support for vulnerable passengers.\"\n  },\n  {\n    \"date\": \"2024-12-28\",\n    \"title\": \"I have been waiting nearly 2 weeks for…\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The customer is frustrated by a lack of communication from customer service regarding a booking issue, reflecting disappointment in the airline’s responsiveness.\"\n  },\n  {\n    \"date\": \"2024-10-18\",\n    \"title\": \"Still waiting for Refund\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The review details an ongoing struggle to receive a refund, highlighting inefficiencies and poor customer support experiences, which contributes to a negative perception of the airline's service.\"\n  }\n]"
}