{
  "response": "json\n[\n  {\n    \"date\": \"2025-01-17\",\n    \"title\": \"Absolutely horrible\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The review expresses extreme dissatisfaction with the prices, planes, and customer service, indicating a negative overall experience.\"\n  },\n  {\n    \"date\": \"2024-06-21\",\n    \"title\": \"BA YOU SHOULD BE ASHAMED OF YOURSELVES\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer outlines a series of frustrating delays and poor customer service, culminating in an inadequate compensation offer, depicting a very negative sentiment.\"\n  },\n  {\n    \"date\": \"2025-01-16\",\n    \"title\": \"BRITISH AIRWAYS AWFUL SERVICE\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"This review highlights the difficulty in receiving a refund for a seat upgrade, portraying a strong frustration with customer service and long wait times.\"\n  },\n  {\n    \"date\": \"2024-11-17\",\n    \"title\": \"British Airways happy to 'steal' from customers! Appalling treatment!\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The review expresses anger and frustration over the inability to book a cello seat, emphasizing a feeling of being treated unfairly and a lack of customer support.\"\n  },\n  {\n    \"date\": \"2025-01-06\",\n    \"title\": \"DO NOT FLY WITH BA!\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer describes a frustrating delay in receiving luggage, resulting in missing a connection and incurring additional costs, highlighting an extremely negative experience.\"\n  },\n  {\n    \"date\": \"2024-10-16\",\n    \"title\": \"Very poor customer service\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer indicates dissatisfaction with limited communication and lack of support after a flight cancellation, leading to extra costs.\"\n  },\n  {\n    \"date\": \"2024-10-01\",\n    \"title\": \"Ridiculously expensive seats and luggages\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The review criticizes the high costs associated with seats and luggage, implying dissatisfaction with price transparency and service quality.\"\n  },\n  {\n    \"date\": \"2025-01-16\",\n    \"title\": \"What a joke of a company\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer describes numerous glitches with the booking process and unresponsive customer service, leading to significant frustration.\"\n  },\n  {\n    \"date\": \"2024-12-09\",\n    \"title\": \"BA data breach & account hacked no help\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The review discusses a serious security breach and inadequate customer service response, leading to deep dissatisfaction with BA's handling of the situation.\"\n  },\n  {\n    \"date\": \"2024-11-08\",\n    \"title\": \"Zero stars is not an option sadly\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer details a prolonged struggle to resolve a flight cancellation issue, emphasizing frustration with BA's customer service and communication.\"\n  },\n  {\n    \"date\": \"2024-12-27\",\n    \"title\": \"No loyalty\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer expresses disappointment over lost loyalty rewards and inadequate service, stating a complete disconnect between expectations and BA's offerings.\"\n  },\n  {\n    \"date\": \"2025-01-05\",\n    \"title\": \"Just wanted to say how good the cabin…\",\n    \"rating\": 5,\n    \"sentimentSummary\": \"The reviewer praises the excellent service provided by the cabin crew, highlighting a positive customer experience.\"\n  },\n  {\n    \"date\": \"2025-01-14\",\n    \"title\": \"Flying back from Schipol in The…\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The review depicts dissatisfaction with customer service when trying to change a flight, leading to a feeling of frustration with BA's policies.\"\n  },\n  {\n    \"date\": \"2024-12-17\",\n    \"title\": \"Flights cancelled took 5 days and 1hr a…\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer details significant inconveniences caused by flight cancellations and BA's lack of support, indicating a very negative experience.\"\n  },\n  {\n    \"date\": \"2025-07-05\",\n    \"title\": \"Outstanding service when flying to…\",\n    \"rating\": 5,\n    \"sentimentSummary\": \"The reviewer shares a highly positive experience regarding service provided to a disabled passenger, reflecting satisfaction with BA.\"\n  },\n  {\n    \"date\": \"2024-11-15\",\n    \"title\": \"Our flight was very late Manchester to…\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer describes a disastrous experience with delayed flights and poor customer support, leading to significant frustration and disillusionment.\"\n  },\n  {\n    \"date\": \"2025-01-10\",\n    \"title\": \"Never again … an abysmal airline\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The review expresses deep dissatisfaction with multiple aspects of a long-haul flight, focusing on comfort and service quality.\"\n  },\n  {\n    \"date\": \"2025-01-10\",\n    \"title\": \"We had such a great experience with BA…\",\n    \"rating\": 5,\n    \"sentimentSummary\": \"The reviewer expresses gratitude for the helpfulness of staff in rescheduling flights, indicating a positive experience with customer support.\"\n  },\n  {\n    \"date\": \"2025-01-10\",\n    \"title\": \"Fabulous service Heathrow to Madrid\",\n    \"rating\": 5,\n    \"sentimentSummary\": \"The review highlights excellent service and special touches during the flight, providing a positive summary of the travel experience.\"\n  },\n  {\n    \"date\": \"2025-01-13\",\n    \"title\": \"2 hours to reschedule a flight - without success!\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer shares frustration over a long call attempting to reschedule a flight, indicating a poor customer service experience.\"\n  }\n]",
  "timestamp": "2025-01-26 09:50:17"
}