{
  "response": "json\n[\n  {\n    \"date\": \"2025-01-10\",\n    \"title\": \"British Airways should leave the service industry\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The review expresses extreme dissatisfaction with British Airways, detailing a catastrophic travel experience that ruined a wedding plan. The reviewer highlights the lack of care from staff, mocking behavior, and threats from management during a health crisis, which led to feelings of humiliation and embarrassment.\"\n  },\n  {\n    \"date\": \"2025-01-10\",\n    \"title\": \"Last 2 flights lost all bags\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer indicates frustration with lost luggage and poor customer service during a tight connection, exacerbated by an unfriendly staff member. The experience has made them consider switching airlines after decades of loyalty, reflecting strong dissatisfaction with British Airways.\"\n  },\n  {\n    \"date\": \"2025-01-10\",\n    \"title\": \"No rules or regulations?\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer conveys confusion and frustration regarding inconsistent policies for bag charges, citing unclear communication from customer service. This ambiguity leads to a negative perception of the airline's operational standards.\"\n  },\n  {\n    \"date\": \"2024-10-14\",\n    \"title\": \"AVOID\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer feels ignored by British Airways, particularly in a critical moment related to a cancer diagnosis and required treatment. The lack of responsiveness indicates a significant failure in customer care.\"\n  },\n  {\n    \"date\": \"2025-01-08\",\n    \"title\": \"An update and warning for those waiting for compensation and refunds from BA\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer shares a distressing experience with a significant flight delay and inadequate customer service. They express frustration over the lack of communication and long wait times for compensation, characterizing BA's service as disrespectful.\"\n  },\n  {\n    \"date\": \"2025-01-04\",\n    \"title\": \"Great Flight. Great Crew.BA0662\",\n    \"rating\": 5,\n    \"sentimentSummary\": \"The reviewer praised British Airways for an excellent travel experience, highlighting efficient check-in, attentive crew, and support provided to a disabled passenger. This positive account contrasts sharply with other reviews.\"\n  },\n  {\n    \"date\": \"2024-12-22\",\n    \"title\": \"Horrible experience with someone with autism\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer describes an upsetting experience involving a staff member at Heathrow, reporting feelings of abuse. The experience underscores the need for sensitivity towards individuals on the autism spectrum.\"\n  },\n  {\n    \"date\": \"2024-01-08\",\n    \"title\": \"The worlds worst airline (after Ryan…\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer bluntly categorizes British Airways as one of the worst airlines, implying frustration with their operations during a time of high demand indicated on their website. This reflects widespread dissatisfaction.\"\n  },\n  {\n    \"date\": \"2024-09-20\",\n    \"title\": \"Lack of customer care\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer expresses disillusionment with British Airways after a canceled flight and unaddressed compensation claims. The lack of acknowledgment and poor communication highlight significant failings in customer service.\"\n  },\n  {\n    \"date\": \"2025-01-08\",\n    \"title\": \"Worst airline in the uk\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer succinctly conveys their disappointment with British Airways, specifically pointing out terrible customer service, reinforcing a negative overall sentiment towards the airline.\"\n  }\n]"
}