{
  "response": "json\n[\n  {\n    \"date\": \"2025-01-03\",\n    \"title\": \"Where are the £539 holidays to st kitts…\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The customer is frustrated due to the inability to locate advertised holiday offers. This indicates a lack of transparency and accessibility in the service.\"\n  },\n  {\n    \"date\": \"2025-01-03\",\n    \"title\": \"Shit\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer expresses strong dissatisfaction with disorganization and time wasted at the airport, which negatively impacts the overall travel experience.\"\n  },\n  {\n    \"date\": \"2025-01-03\",\n    \"title\": \"The worst customer service\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer highlights extremely poor customer service, unprofessional behavior from staff, and inadequate seating comfort, leading to a very negative view of the airline.\"\n  },\n  {\n    \"date\": \"2024-12-30\",\n    \"title\": \"bad crew member David\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer reports an unpleasant encounter with a rude crew member, coupled with a lack of consideration for passenger comfort, contributing to an overall negative experience.\"\n  },\n  {\n    \"date\": \"2025-01-02\",\n    \"title\": \"Atrocious\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The sentiment reflects complete dissatisfaction with multiple aspects of the airline, including pricing and customer service, portraying a very negative perception.\"\n  },\n  {\n    \"date\": \"2025-01-01\",\n    \"title\": \"The only gripe I have is their policy…\",\n    \"rating\": 3,\n    \"sentimentSummary\": \"While the reviewer presents a moderate rating, they express concern over baggage policies that complicate travel comfort, indicating room for improvement rather than outright negativity.\"\n  },\n  {\n    \"date\": \"2025-01-03\",\n    \"title\": \"Greed\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer is outraged by expensive fares combined with hidden costs, perceiving the airline as greedy and expressing disappointment with management practices.\"\n  },\n  {\n    \"date\": \"2024-12-05\",\n    \"title\": \"Baby not allowed in a lounge with Gold Card!\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer expresses frustration over strict policies regarding lounge access with a child, compounded by poor assistance from staff, leading to a severe disappointment with the airline's service.\"\n  },\n  {\n    \"date\": \"2024-10-15\",\n    \"title\": \"Pathetic and misleading customer service\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The customer describes a frustrating experience with lost luggage and inadequate follow-up, highlighting issues with service response and accountability.\"\n  },\n  {\n    \"date\": \"2025-01-02\",\n    \"title\": \"Shocking customer service - Lies and no complaints procedure\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer feels misled and frustrated by the lack of a proper complaints process and unhelpful customer service agents, leading to a deeply negative impression of the brand.\"\n  }\n]"
}