{
  "response": "json\n[\n  {\n    \"date\": \"2025-01-08\",\n    \"title\": \"I'd like to thank Kate Roche in…\",\n    \"rating\": 5,\n    \"sentimentSummary\": \"The review is highly positive, praising Kate Roche from customer services for exceptional support in booking a flight. The customer appreciated the attention to detail in seating arrangements, highlighting Kate's impeccable manner and knowledge.\"\n  },\n  {\n    \"date\": \"2025-01-07\",\n    \"title\": \"BA is killing itself off.\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The review expresses severe dissatisfaction with British Airways' new loyalty scheme, indicating that it will significantly disadvantage loyal customers. The reviewer feels betrayed after extensive loyalty and indicates a strong intention to switch to another airline.\"\n  },\n  {\n    \"date\": \"2025-01-08\",\n    \"title\": \"A final nail in the coffin!\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"This review is extremely negative regarding British Airways, criticizing the recent rewards program changes that have stripped away long-term benefits for loyal customers. The reviewer expresses a firm commitment to leaving the airline, reflecting a sense of betrayal and frustration.\"\n  },\n  {\n    \"date\": \"2025-01-08\",\n    \"title\": \"Appalling Service from Customer Relations Team regarding a refund\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The review reveals deep dissatisfaction with the customer relations team's service, particularly regarding a delayed refund for an erroneously charged hold bag. The author emphasizes the lack of communication and progress updates that have left them frustrated and unwilling to use British Airways again.\"\n  },\n  {\n    \"date\": \"2025-01-02\",\n    \"title\": \"I can't believe what used to be the…\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer conveys disappointment over recent booking issues and the perceived decline in British Airways' service quality. Frustrated by a lack of resolution and inadequate compensation, the reviewer considers switching to another airline for future travels.\"\n  },\n  {\n    \"date\": \"2024-07-24\",\n    \"title\": \"I honestly cannot believe this company…\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The review details a disastrous experience involving a lengthy flight delay and lost baggage. The reviewer feels abandoned by customer service and expresses disbelief at the airline's operational failures, leading them to contemplate legal action.\"\n  },\n  {\n    \"date\": \"2024-12-22\",\n    \"title\": \"We were booked to sit upstairs on the…\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"This review is extremely critical of British Airways for changing the seating arrangement without notification, leading to disappointment for the customer's son during the holiday season. The lack of a refund after paying for a premium seating choice epitomizes the reviewer's frustration.\"\n  },\n  {\n    \"date\": \"2025-01-07\",\n    \"title\": \"They couldn’t care less\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The review highlights a frustrating travel experience marred by delay and poor customer service. The reviewer criticizes British Airways for unsatisfactory handling of luggage and inadequate communication, leading to a highly negative impression of the airline.\"\n  },\n  {\n    \"date\": \"2024-01-07\",\n    \"title\": \"Unprofessional\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"This review describes a series of unprofessional mishaps involving incorrect flight information and inadequate customer assistance, ultimately causing significant distress during the travel experience. The reviewer expresses disappointment with British Airways' handling of their complaint.\"\n  },\n  {\n    \"date\": \"2025-01-03\",\n    \"title\": \"Poor service and no reward for loyalty\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer expresses disappointment regarding the decline in British Airways' service, particularly after being made to wait for priority luggage. The author deems the airline unworthy of their loyalty, suggesting that they are eager to explore alternatives due to dissatisfaction.\"\n  }\n]"
}