{
  "response": "json\n[\n  {\n    \"date\": \"2025-01-11\",\n    \"title\": \"BA worst airline in the WORLD!!\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The review expresses extreme dissatisfaction with British Airways, highlighting a significant issue with flight cancellations, lack of compensation, and overall poor customer service. The reviewer feels financially burdened and frustrated by the airline's apparent incompetence and lack of care for their customers.\"\n  },\n  {\n    \"date\": \"2025-01-02\",\n    \"title\": \"Very disappointing flight\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"This review reflects deep disappointment with the flight experience, citing rude and unresponsive staff, poor food quality, and uncomfortable seating. The reviewer is hopeful that future flights may improve, but their first experience has left a negative impression.\"\n  },\n  {\n    \"date\": \"2025-01-11\",\n    \"title\": \"Poor customer service\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The customer expresses frustration with the customer service of British Airways, detailing multiple calls with inconsistent information and arrogant staff. They contrast this with a positive experience from another airline, indicating a strong dissatisfaction with BA.\"\n  },\n  {\n    \"date\": \"2025-01-02\",\n    \"title\": \"They get such a slating but I actually like them and recently had a great experience with them\",\n    \"rating\": 5,\n    \"sentimentSummary\": \"A positive review highlighting an improved experience with British Airways. The reviewer appreciates the service, indicating a favorable perspective compared to the negative experiences reflected in other reviews.\"\n  },\n  {\n    \"date\": \"2024-03-13\",\n    \"title\": \"HORRIBLE CUSTOMER SERVICE\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer shares a frustrating experience with BA’s customer service, mentioning delays in receiving a refund and inconsistent information provided by staff. They feel misled and disappointed, particularly by the insufficient compensation offered.\"\n  },\n  {\n    \"date\": \"2025-01-04\",\n    \"title\": \"Such arrogant staff and poor service all in all\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"This review indicates very poor service experienced on a long-haul flight, emphasizing the arrogance of the staff, inadequate food, and overall lack of monitoring within the airline's operations. There are no positive aspects mentioned, reinforcing a highly negative sentiment.\"\n  },\n  {\n    \"date\": \"2025-01-08\",\n    \"title\": \"Possibly the Worst Website a Mediocre Airline Ever Had\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer describes significant issues with flight punctuality and poor website functionality, including lost baggage and misleading information. They express a strong urge for improvement from British Airways and reflect a generally negative experience.\"\n  },\n  {\n    \"date\": \"2024-12-28\",\n    \"title\": \"Efficient helpful professional airline\",\n    \"rating\": 5,\n    \"sentimentSummary\": \"A positive review detailing a pleasant flight experience with efficient booking and excellent customer service support at the airport. The reviewer expresses satisfaction and intentions to fly with BA again.\"\n  },\n  {\n    \"date\": \"2025-01-10\",\n    \"title\": \"Don’t fly Ba you will never get onward taxi transport\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer expresses anger regarding flight cancellations and the resulting financial loss. They indicate a reluctance to recommend using British Airways in the future, based on their negative experience.\"\n  },\n  {\n    \"date\": \"2025-01-08\",\n    \"title\": \"Gobsmackingly inept company\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"This review showcases extreme frustration with British Airways regarding customer service and ineptitude related to lost belongings. The reviewer feels ignored and unable to submit a complaint, indicating a significant lack of support.\"\n  }\n]"
}