{
  "response": "json\n[\n  {\n    \"date\": \"2024-09-12\",\n    \"title\": \"Terrible treatment on a business class…\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The review expresses extreme dissatisfaction with British Airways due to poor seating arrangements, refusal to accommodate requests, and inadequate customer service, leading to distress for the reviewer, who is a nervous flyer.\"\n  },\n  {\n    \"date\": \"2025-01-13\",\n    \"title\": \"Access to BA customer service\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer is frustrated with British Airways' customer service, particularly the lack of communication and resolution regarding a simple receipt request, indicating a significant decline in service quality.\"\n  },\n  {\n    \"date\": \"2024-12-26\",\n    \"title\": \"Came here to write a one star review\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"This review depicts a very negative experience with British Airways, highlighted by cancelled flights without alternatives, poor handling of complaints, and a considerable financial loss incurred by the reviewer.\"\n  },\n  {\n    \"date\": \"2024-12-09\",\n    \"title\": \"No catering on flight in business class\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer expresses disappointment over the lack of catering on a business class flight and further dissatisfaction with British Airways' failure to respond to their complaint, questioning the airline’s commitment to customer service.\"\n  },\n  {\n    \"date\": \"2024-12-30\",\n    \"title\": \"BA reveal themselves as vicious and uncaring\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The review outlines significant dissatisfaction with delays and inadequate compensation, portraying British Airways as uncaring and unresponsive to customer needs, especially in times of crisis.\"\n  },\n  {\n    \"date\": \"2024-11-17\",\n    \"title\": \"This started with a cancelled flight\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer shares a frustrating experience with British Airways regarding a flight cancellation, highlighting a lack of assistance and prolonged claims processing, leading to feelings of helplessness.\"\n  },\n  {\n    \"date\": \"2025-01-12\",\n    \"title\": \"Like many people said\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"Deep frustration is evident in this review, reflecting poor customer support and the airline's failure to meet basic service expectations, pushing the reviewer to vow against future travel with British Airways.\"\n  },\n  {\n    \"date\": \"2025-01-12\",\n    \"title\": \"Dear OWNERS of British Airlines\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"This review articulates a disappointing experience with delays and unhelpful staff, suggesting a serious decline in British Airways' service quality and urging the airline to take customer feedback seriously.\"\n  },\n  {\n    \"date\": \"2025-01-12\",\n    \"title\": \"Great service\",\n    \"rating\": 5,\n    \"sentimentSummary\": \"A positive review highlighting excellent service from a staff member named Lindsey, who reportedly made the rebooking process easy and handled the customer's needs with patience.\"\n  },\n  {\n    \"date\": \"2025-01-12\",\n    \"title\": \"Unfriendly food disgusting hardly any…\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer criticizes the in-flight food quality and a lack of drink service on a long haul flight, which contributed to a negative travel experience.\"\n  }\n]"
}