{
  "response": "json\n[\n  {\n    \"date\": \"2025-01-17\",\n    \"title\": \"Absolutely horrible\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The review expresses extreme dissatisfaction with the company, highlighting issues with pricing, aircraft quality, and particularly poor customer service, suggesting that only the pilots are deemed competent.\"\n  },\n  {\n    \"date\": \"2024-06-21\",\n    \"title\": \"BA YOU SHOULD BE ASHAMED OF YOURSELVES\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The review details a frustrating experience involving significant delays and unhelpful customer service following a missed flight connection. The reviewer emphasizes the lack of adequate compensation and support from the airline, feeling neglected and cheated.\"\n  },\n  {\n    \"date\": \"2025-01-16\",\n    \"title\": \"BRITISH AIRWAYS AWFUL SERVICE\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The review conveys deep frustration over the failure to provide a paid seat upgrade and issues with obtaining a refund for this service. The reviewer describes multiple failed contacts with customer service, including ineffective automated assistance.\"\n  },\n  {\n    \"date\": \"2024-11-17\",\n    \"title\": \"British Airways happy to 'steal' from customers! Appalling treatment!\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer is infuriated by the perceived incompetence of British Airways customer service regarding seat booking for a cello. They describe the process as convoluted and the staff as unhelpful, claiming that the company stole their money and disregarded their requests.\"\n  },\n  {\n    \"date\": \"2025-01-06\",\n    \"title\": \"DO NOT FLY WITH BA!\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer recounts a poor experience involving a long wait for baggage that resulted in missing a connecting flight. They are frustrated with the lack of support from BA’s staff when trying to resolve the situation, labeling the service as atrocious.\"\n  },\n  {\n    \"date\": \"2024-10-16\",\n    \"title\": \"Very poor customer service\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer expresses dissatisfaction with BA's service, mentioning a flight cancellation and inadequate communication. They highlight additional expenses incurred due to a lack of compensation and assistance during the ordeal.\"\n  },\n  {\n    \"date\": \"2024-10-01\",\n    \"title\": \"Ridiculously expensive seats and luggages\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer is upset about the high costs associated with seat reservations and luggage fees. They feel misled by the pricing structure and indicate a decision to stop using BA altogether, citing a general lack of care for customer concerns.\"\n  },\n  {\n    \"date\": \"2025-01-16\",\n    \"title\": \"What a joke of a company\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The review articulates strong dissatisfaction with almost every aspect of BA, from website functionality to customer service and in-flight experience. The reviewer believes BA has severely declined in quality and advocates for significant improvements.\"\n  },\n  {\n    \"date\": \"2024-12-09\",\n    \"title\": \"BA data breach & account hacked no help\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer is concerned about a data breach involving their account with BA, describing long wait times and poor security response from customer service. They express discontent over the lack of attention and resolution following the breach.\"\n  },\n  {\n    \"date\": \"2024-11-08\",\n    \"title\": \"Zero stars is not an option sadly\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer describes a frustrating experience with BA's customer service following a cancelled flight, emphasizing obstacles in communication and an unsatisfactory process for claims and refunds. They strongly advise against booking with BA.\"\n  }\n]"
}