{
  "response": "json\n[\n  {\n    \"date\": \"2024-12-28\",\n    \"title\": \"Where to start 😡\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The customer has had a highly negative experience with British Airways due to cancelled flights, poor communication, delays, and unprofessional staff at the gate. They explicitly advise other travelers to avoid the airline at all costs.\"\n  },\n  {\n    \"date\": \"2025-01-03\",\n    \"title\": \"BA what a change in 25years!\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The review expresses deep dissatisfaction with British Airways, highlighting the decline in service quality over 25 years. The customer cites multiple issues, including discomfort on the aircraft, poor food, lack of proper facilities, and delayed luggage, concluding that they will not fly with BA again.\"\n  },\n  {\n    \"date\": \"2025-01-03\",\n    \"title\": \"Had an issue through no fault of BA and…\",\n    \"rating\": 5,\n    \"sentimentSummary\": \"This customer had a positive experience with British Airways in resolving a flight change issue. They praised the helpful and competent staff, noting that there were no extra fees or complications, demonstrating satisfactory customer service.\"\n  },\n  {\n    \"date\": \"2024-12-04\",\n    \"title\": \"Incompetent service, & fail to respond to written complaint\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The customer experienced a highly frustrating situation with British Airways regarding a cancelled flight. They received incorrect information from staff, leading to the cancellation of their entire booking. The lack of response to their written complaint has caused significant disappointment and distrust in the airline.\"\n  },\n  {\n    \"date\": \"2025-01-06\",\n    \"title\": \"A NIGHTMARE FOR OUR FAMILY!!!\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The review describes a disastrous travel experience with British Airways, where a delay caused significant havoc for a family of six. The customer criticizes the airline's lack of empathy and support during the ordeal, leading to feelings of abandonment and a complete lack of basic customer service.\"\n  },\n  {\n    \"date\": \"2024-11-23\",\n    \"title\": \"Overbooked and involuntarily canceled…\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The customer faced a distressing situation when their flight was canceled without proper assistance, leading to financial losses and emotional distress during a family emergency. The lack of support and inadequate compensation reflects a serious flaw in customer service.\"\n  },\n  {\n    \"date\": \"2025-01-06\",\n    \"title\": \"Absolutely Shocking Customer Service for Refund\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The review highlights a shocking customer service experience with British Airways after a significant flight cancellation. The long wait times for refunds and inadequate support have led to deep disappointment, and the customer expresses a strong intention to avoid the airline in the future.\"\n  },\n  {\n    \"date\": \"2025-01-06\",\n    \"title\": \"Worse than Ryanair\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The customer expresses extreme dissatisfaction, likening British Airways to a low-cost airline and critiquing their communication and service. The overall sentiment is one of frustration and a strong recommendation to avoid the airline.\"\n  },\n  {\n    \"date\": \"2024-10-14\",\n    \"title\": \"Avoid when possible\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"This review conveys disappointment with British Airways for a flight cancellation attributed inconsistently to operational issues. The customer feels misled and criticizes the lack of included services for long-haul flights.\"\n  },\n  {\n    \"date\": \"2024-10-11\",\n    \"title\": \"Overbooked flight\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The customer describes a frustrating experience with BA overbooking a flight, leading to a delayed departure and additional out-of-pocket expenses. The lack of communication regarding complaints has exacerbated their disappointment, resulting in a strong negative review.\"\n  }\n]"
}