{
  "response": "json\n[\n  {\n    \"date\": \"2024-09-12\",\n    \"title\": \"Terrible treatment on a business class…\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The review describes a distressing experience due to unhelpful seat arrangements on a flight and poor customer service during the complaint process, culminating in a long wait for a refund and dissatisfaction with the company's handling of the issue.\"\n  },\n  {\n    \"date\": \"2025-01-13\",\n    \"title\": \"Access to BA customer service\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer expresses frustration over the inability to obtain a simple receipt for past flights, highlighting poor customer service characterized by lack of resolution and being disconnected during live chats.\"\n  },\n  {\n    \"date\": \"2024-12-26\",\n    \"title\": \"Came here to write a one star review\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"This review indicates extreme dissatisfaction with British Airways for cancelling flights without alternatives, leading to costly last-minute arrangements and a feeling of being ignored when raising complaints.\"\n  },\n  {\n    \"date\": \"2024-12-09\",\n    \"title\": \"No catering on flight in business class\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer is disappointed by the lack of catering on a business class flight and the company's failure to address a subsequent complaint, indicating a decline in service standards for loyal customers.\"\n  },\n  {\n    \"date\": \"2024-12-30\",\n    \"title\": \"BA reveal themselves as vicious and uncaring\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"This review discusses deep frustration over cancelled flights and inadequate customer support, emphasizing the exorbitant costs incurred due to poor service, and lack of appropriate solutions offered by the airline.\"\n  },\n  {\n    \"date\": \"2024-11-17\",\n    \"title\": \"This started with a cancelled flight\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer recounts a negative experience starting with a flight cancellation, poor rebooking options, and difficulties in claiming reimbursement, leading to significant frustration with customer support.\"\n  },\n  {\n    \"date\": \"2025-01-12\",\n    \"title\": \"Like many people said\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The review conveys a strong negative sentiment towards British Airways, highlighting rude and unhelpful staff and overall poor service, resulting in a decision to avoid the airline in the future.\"\n  },\n  {\n    \"date\": \"2025-01-12\",\n    \"title\": \"Dear OWNERS of British Airlines\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The review expresses disappointment and frustration with an extensive flight delay and rude staff, leading the reviewer to lose faith in British Airways as a premium airline.\"\n  },\n  {\n    \"date\": \"2025-01-12\",\n    \"title\": \"Great service\",\n    \"rating\": 5,\n    \"sentimentSummary\": \"In contrast to other reviews, this one highlights a positive experience with excellent service during a rebooking process, showcasing a rare instance of satisfaction with British Airways.\"\n  },\n  {\n    \"date\": \"2025-01-12\",\n    \"title\": \"Unfriendly food disgusting hardly any…\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer expresses dissatisfaction with the food service on a long-haul flight, describing it as unfriendly and inadequate, contributing to an overall negative impression of the airline.\"\n  },\n  {\n    \"date\": \"2025-01-11\",\n    \"title\": \"BA worst airline in the WORLD!!\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The review lamenting British Airways’ service recounts a cancelled flight with no proper compensation offered, resulting in significant additional financial strain on the reviewer.\"\n  },\n  {\n    \"date\": \"2025-01-02\",\n    \"title\": \"Very disappointing flight\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer details disappointment with poor service and experience on their first flight with British Airways, criticizing the staff, food quality, and overall comfort, suggesting this may lead to a decision to not fly with them again.\"\n  },\n  {\n    \"date\": \"2025-01-11\",\n    \"title\": \"Poor customer service\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The review expresses frustration over inconsistent information provided by British Airways' staff during multiple calls, highlighting poor customer service in contrast to a competitor's efficiency.\"\n  },\n  {\n    \"date\": \"2025-01-02\",\n    \"title\": \"They get such a slating but I actually like them and recently had a great experience with them\",\n    \"rating\": 5,\n    \"sentimentSummary\": \"A rare positive review indicating that despite the negative feedback, the reviewer had a satisfactory experience, suggesting that the airline is improving.\"\n  },\n  {\n    \"date\": \"2024-03-13\",\n    \"title\": \"HORRIBLE CUSTOMER SERVICE\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The review highlights a shocking lack of customer service after a refund mishap, emphasizing miscommunication and a long struggle to resolve issues, culminating in a loss of confidence in the airline.\"\n  },\n  {\n    \"date\": \"2025-01-04\",\n    \"title\": \"Such arrogant staff and poor service all in all\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The review describes a negative experience with unprofessional staff and inadequate flight services, reinforcing a poor perception of the airline compared to budget alternatives.\"\n  },\n  {\n    \"date\": \"2025-01-08\",\n    \"title\": \"Possibly the Worst Website a Mediocre Airline Ever Had\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer shares a series of frustrating experiences related to delayed flights and lost luggage, compounded by a poorly designed website, leading to an overall negative impression.\"\n  },\n  {\n    \"date\": \"2024-12-28\",\n    \"title\": \"Efficient helpful professional airline\",\n    \"rating\": 5,\n    \"sentimentSummary\": \"This review presents a contrasting positive experience, noting excellent booking and customer service which led to a decision to fly with British Airways in the future.\"\n  },\n  {\n    \"date\": \"2025-01-10\",\n    \"title\": \"Don’t fly Ba you will never get onward taxi transport\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer directs criticism at British Airways for the impact of a flight cancellation on their transportation arrangements, expressing frustration with the airline.\"\n  },\n  {\n    \"date\": \"2025-01-08\",\n    \"title\": \"Gobsmackingly inept company\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer conveys disbelief at British Airways' handling of a lost item and difficulty navigating their complaints process, warning others to avoid the airline.\"\n  }\n]",
  "timestamp": "2025-01-26 09:50:39"
}