{
  "response": "json\n[\n  {\n    \"date\": \"2024-12-27\",\n    \"title\": \"No loyalty\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer expresses deep disappointment in British Airways due to poor customer service regarding a companion voucher issue and a lack of loyalty rewards. They describe being put on a blacklist and feel strongly that their years of loyalty have not been reciprocated.\"\n  },\n  {\n    \"date\": \"2025-01-05\",\n    \"title\": \"Just wanted to say how good the cabin…\",\n    \"rating\": 5,\n    \"sentimentSummary\": \"The reviewer praises the outstanding service provided by cabin crew on a flight, highlighting the excellent experience and teamwork, indicating a very positive customer experience.\"\n  },\n  {\n    \"date\": \"2025-01-14\",\n    \"title\": \"Flying back from Schipol in The…\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer is frustrated with the lack of in-person support at the airport for changing a flight, resulting in unnecessary complications and confusion. They criticize the overall customer service, feeling that British Airways does not care about their passengers.\"\n  },\n  {\n    \"date\": \"2024-12-17\",\n    \"title\": \"Flights cancelled took 5 days and 1hr a…\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer describes a very negative experience with flight cancellations and poor customer support, ultimately leading to significant additional costs. They feel mistreated by the airline and express extreme dissatisfaction.\"\n  },\n  {\n    \"date\": \"2024-07-05\",\n    \"title\": \"Outstanding service when flying to…\",\n    \"rating\": 5,\n    \"sentimentSummary\": \"The reviewer shares a highly positive experience traveling with a disabled daughter, noting respectful and kind treatment from staff throughout the journey.\"\n  },\n  {\n    \"date\": \"2024-11-15\",\n    \"title\": \"Our flight was very late Manchester to…\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer expresses anger and frustration over a significant flight delay that resulted in missed connections and extra costs. They complaint about the lack of empathy from staff and the refusal of refunds, branding British Airways as the worst airline they have experienced.\"\n  },\n  {\n    \"date\": \"2025-01-10\",\n    \"title\": \"Never again … an abysmal airline\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer describes a horrific experience on a long-haul flight with uncomfortable seating, inadequate cabin conditions, and poor food choices. They emphasize their suffering and vow never to fly with British Airways again due to the overall negative experience.\"\n  },\n  {\n    \"date\": \"2025-01-10\",\n    \"title\": \"We had such a great experience with BA…\",\n    \"rating\": 5,\n    \"sentimentSummary\": \"The reviewer enthusiastically shares a positive experience with British Airways' customer service. They highlight kind assistance during flight changes, making it a refreshing break from typical frustrating experiences with call centers.\"\n  },\n  {\n    \"date\": \"2025-01-10\",\n    \"title\": \"Fabulous service Heathrow to Madrid\",\n    \"rating\": 5,\n    \"sentimentSummary\": \"The reviewer praises the excellent service received during a flight, noting the staff's friendliness and helpfulness, as well as a complimentary bottle of champagne to celebrate a friend's birthday. This indicates a wonderful customer experience.\"\n  },\n  {\n    \"date\": \"2025-01-13\",\n    \"title\": \"2 hours to reschedule a flight - without success!\",\n    \"rating\": 1,\n    \"sentimentSummary\": \"The reviewer is frustrated by the lengthy and unproductive attempts to reschedule an Avios reward flight, labeling British Airways customer service as a disorganized 'mess', reflecting a deeply negative experience.\"\n  }\n]"
}