[
  {
    "companyPageUrl": "https://www.trustpilot.com/review/www.britishairways.com?languages=English&sort=recency",
    "reviewId": "677cfe67e2c6bec4acebdf1a",
    "companyName": "British Airways",
    "businessUnitId": "46d2e587000064000500a0e0",
    "reviewUrl": "https://trustpilot.com/reviews/677cfe67e2c6bec4acebdf1a",
    "reviewDate": "Tuesday, January 7, 2025 at 12:13:59 PM",
    "reviewDateOfExperience": "December 28, 2024",
    "reviewLabel": "",
    "isReviewVerified": false,
    "reviewer": "Shaun",
    "reviewTitle": "Where to start 😡",
    "reviewDescription": "Where to start 😡\nFrom having flights cancelled.. to lack of communication to then delayed flights and attitude from staff at the gate, This is the first time I have flown with BA and never ever again…I would advise if you have an alternative then avoid BA at all costs",
    "reviewRatingScore": 1,
    "reviewersCountry": "GB",
    "reviewLanguage": "all",
    "reviewCompanyResponse": "",
    "scrapedDateTime": "2025-01-17T17:49:23.606Z",
    "scrapedAtReviewPageNumber": 4
  },
  {
    "companyPageUrl": "https://www.trustpilot.com/review/www.britishairways.com?languages=English&sort=recency",
    "reviewId": "677ced7fa323ef1fc86eab8c",
    "companyName": "British Airways",
    "businessUnitId": "46d2e587000064000500a0e0",
    "reviewUrl": "https://trustpilot.com/reviews/677ced7fa323ef1fc86eab8c",
    "reviewDate": "Tuesday, January 7, 2025 at 11:01:51 AM",
    "reviewDateOfExperience": "January 03, 2025",
    "reviewLabel": "",
    "isReviewVerified": false,
    "reviewer": "Heidi Duncan",
    "reviewTitle": "BA what a change in 25years!",
    "reviewDescription": "I haven’t flown with BA for 25 years what a change! Aircraft tired and dreary - crew no better. Food was disgusting. Aircraft A380 was cold - no water in toilet for washing hands staff provided a bottle - door didn’t close properly. TVs weren’t working great. Flight delayed with poor excuse. Then had to wait 2 hours for luggage to come through. BA used to be top notch - gone right downhill - will not be flying again. Experience with short haul flying with Jet2 so much better!! Really disappointed, especially as fares not cheap!",
    "reviewRatingScore": 1,
    "reviewersCountry": "GB",
    "reviewLanguage": "all",
    "reviewCompanyResponse": "",
    "scrapedDateTime": "2025-01-17T17:49:23.742Z",
    "scrapedAtReviewPageNumber": 4
  },
  {
    "companyPageUrl": "https://www.trustpilot.com/review/www.britishairways.com?languages=English&sort=recency",
    "reviewId": "677cd9cb8c6729e094527814",
    "companyName": "British Airways",
    "businessUnitId": "46d2e587000064000500a0e0",
    "reviewUrl": "https://trustpilot.com/reviews/677cd9cb8c6729e094527814",
    "reviewDate": "Tuesday, January 7, 2025 at 09:37:47 AM",
    "reviewDateOfExperience": "January 03, 2025",
    "reviewLabel": "",
    "isReviewVerified": false,
    "reviewer": "Mrs Karen Kelly",
    "reviewTitle": "Had an issue through no fault of BA and…",
    "reviewDescription": "Had an issue through no fault of BA and had to change flight\nWe were travelling with 2 older people.\n\nThe staff were so helpful and understanding.\nOur flight was protected and they were extremely helpful in rebooking .\nThere was no mention of admin costs extra fees etc\n\nThe staff were friendly and competent.\n",
    "reviewRatingScore": 5,
    "reviewersCountry": "GB",
    "reviewLanguage": "all",
    "reviewCompanyResponse": "",
    "scrapedDateTime": "2025-01-17T17:49:30.932Z",
    "scrapedAtReviewPageNumber": 5
  },
  {
    "companyPageUrl": "https://www.trustpilot.com/review/www.britishairways.com?languages=English&sort=recency",
    "reviewId": "677c6159bc3c4d568cff2336",
    "companyName": "British Airways",
    "businessUnitId": "46d2e587000064000500a0e0",
    "reviewUrl": "https://trustpilot.com/reviews/677c6159bc3c4d568cff2336",
    "reviewDate": "Tuesday, January 7, 2025 at 01:03:53 AM",
    "reviewDateOfExperience": "December 04, 2024",
    "reviewLabel": "",
    "isReviewVerified": false,
    "reviewer": "Jonathan Speed",
    "reviewTitle": "Incompetent service, & fail to respond to written complaint",
    "reviewDescription": "Back in Summer 2024, we booked two BA return flights to Istanbul for May 2025; In December we received an email from BA saying our return flight on 13/05/25 (BA603) had been cancelled and we were offered a flight 24 hours later.\n\nThis was no use to us - due to pre-booked accommodation and annual leave dates. I called BA who told me there were no other flights available on 13/05 from Istanbul to Heathrow; I was told there were no BA flights at all on that day. I therefore cancelled the entire booking.\n\nI have since discovered the BA representative who told me there were no alternative flights available was incorrect. There are THREE BA flights on 13/05/25. One leaves just thirty minutes later than our original flight time. Re-booking this new flight would cost significantly more than I originally paid.\n\nI therefore called customer services, and asked that my booking be reinstated, on the new flight, at the original price. The representative told me that they could not assist me because my booking was cancelled. However - I only cancelled the entire booking due to the false information I was given in BA's cancellation email, and in the subsequent phone call with BA.\nBA customer services advised me to raise a written complaint via their website. I did this on 5/12/24, a month ago. I received an online acknowledgement (with a reference number) which said that my complaint would be investigated thoroughly and someone would be back in touch with me as soon as possible.\nI never heard another thing. So I have had to book flights with an alternative carrier, and I have learned the hard way that BA is no longer 'the airline of choice'.\nI won't trust them in future - they don't seem to know what they are doing and can't even be bothered to respond to a written complaint.",
    "reviewRatingScore": 1,
    "reviewersCountry": "GB",
    "reviewLanguage": "all",
    "reviewCompanyResponse": "",
    "scrapedDateTime": "2025-01-17T17:49:31.256Z",
    "scrapedAtReviewPageNumber": 5
  },
  {
    "companyPageUrl": "https://www.trustpilot.com/review/www.britishairways.com?languages=English&sort=recency",
    "reviewId": "677c2adb0f8ed67c39631961",
    "companyName": "British Airways",
    "businessUnitId": "46d2e587000064000500a0e0",
    "reviewUrl": "https://trustpilot.com/reviews/677c2adb0f8ed67c39631961",
    "reviewDate": "Monday, January 6, 2025 at 09:11:23 PM",
    "reviewDateOfExperience": "January 06, 2025",
    "reviewLabel": "",
    "isReviewVerified": false,
    "reviewer": "Levon Yengibaryan",
    "reviewTitle": "A NIGHTMARE FOR OUR FAMILY!!!",
    "reviewDescription": "Our recent experience with British Airways was beyond disappointing—it was infuriating, exhausting, and completely unacceptable. We were traveling as a family of six, including an 8-year-old child, with 10 pieces of luggage, and a daughter with a health condition that made this ordeal even harder to endure. What was supposed to be a straightforward journey from Prague to Los Angeles turned into a multi-day disaster.\n\nFirst, our flight from Prague to London was delayed by 10 hours, causing us to miss our connecting flight to Los Angeles. Instead of finding a reasonable solution, British Airways rescheduled us with a 48-hour layover in London. We were forced to endure an unnecessary two-day stay, and what made it worse was the complete lack of empathy or effort from the airline staff at Heathrow. Frankly, they did not care about our situation, offered no genuine assistance, and left us feeling abandoned in an already stressful situation. There wasn't even a live agent available at the airport and we had to wait in a long line to call and talk to someone. It is important to mention that there were earlier flights available that were leaving with empty seats in higher class cabins, but the airline refused to give us those seats.\n\nWhen we were finally sent to an airport hotel, things didn’t improve. After traveling for hours with a child, we arrived only to find that our room wasn’t ready for multiple hours, forcing us to sit in the lobby, hungry, tired, and with nowhere to rest or work. To make matters worse, we were all missing work and had to keep up with remote responsibilities in a completely unsuitable environment. Despite our repeated requests for help, no one at the hotel or British Airways was willing to assist us, leaving us feeling ignored and helpless. The hotel vouchers they gave us were for only 1 night and whem we told them that our flight is 2 days after, they said that we need to go back to the airport the next day to get new vouchers and there is no guarantee that it will be the same hotel...\n\nOn top of everything, the hotel was over an hour’s drive from the city center, meaning we couldn’t even make the best of this awful layover by exploring the city. Instead, we were stuck far from everything, with no options other than waiting around miserably until our next flight.\n\nBritish Airways showed zero regard for our time, comfort, or well-being, and this experience was nothing short of a nightmare for our entire family. It’s one thing to encounter delays, but the lack of basic customer service and accountability we faced is completely inexcusable. I would strongly advise anyone considering flying with British Airways to think twice—no one deserves to go through what we did.\n\nWe expect a formal response and adequate compensation for the enormous inconvenience and distress caused by this ordeal. Anything less would only add to the disappointment we already feel.",
    "reviewRatingScore": 1,
    "reviewersCountry": "GB",
    "reviewLanguage": "all",
    "reviewCompanyResponse": "",
    "scrapedDateTime": "2025-01-17T17:49:31.356Z",
    "scrapedAtReviewPageNumber": 5
  },
  {
    "companyPageUrl": "https://www.trustpilot.com/review/www.britishairways.com?languages=English&sort=recency",
    "reviewId": "677bfac5de71bca9df36ccdc",
    "companyName": "British Airways",
    "businessUnitId": "46d2e587000064000500a0e0",
    "reviewUrl": "https://trustpilot.com/reviews/677bfac5de71bca9df36ccdc",
    "reviewDate": "Monday, January 6, 2025 at 05:46:13 PM",
    "reviewDateOfExperience": "November 23, 2024",
    "reviewLabel": "",
    "isReviewVerified": false,
    "reviewer": "Jason Schoener",
    "reviewTitle": "Overbooked and involuntarily canceled…",
    "reviewDescription": "Overbooked and involuntarily canceled when flying to grandmother funeral. No refund, no rebooking and no staff at Zagreb airport, only contractors that said it was canceled. Was on hold with BA for over 2 hours and 12 minutes with nobody picking up. We had to rebook for $3108 and submitted a complaint thinking similar to other overbooking with other airlines we would be refunded. They pointed out in T&Cs they are only obligated to refund 100 GBP per ticket for inconveniences. Basically, lost $1559 ticket plus another $3108 ticket purchased and found out they resold/oversold our ticket for 2999 GBP. I am upset my grandmother's death was an inconvenience to your company and that the agent who wrote the response to our claim was annoyed that BA only made $1559 plus 2999 GBP on the seat that was probably sold to some desperate or rich person that didn't have a funeral to go to an likely a nice holiday, who knows. I feel if you buy a ticket, you buy a ticket. Should I be stupid enough to not show, BA is still compensated for the seat because it was paid for. It is a poor excuse to say you overbook to be efficient. Other airlines rebooked or refunded, yours did not. You are hurting people financially and emotionally when they are going through a difficult time with travel and all at the expense of profit.",
    "reviewRatingScore": 1,
    "reviewersCountry": "GB",
    "reviewLanguage": "all",
    "reviewCompanyResponse": "",
    "scrapedDateTime": "2025-01-17T17:49:31.768Z",
    "scrapedAtReviewPageNumber": 5
  },
  {
    "companyPageUrl": "https://www.trustpilot.com/review/www.britishairways.com?languages=English&sort=recency",
    "reviewId": "677be4d43ae502a983812192",
    "companyName": "British Airways",
    "businessUnitId": "46d2e587000064000500a0e0",
    "reviewUrl": "https://trustpilot.com/reviews/677be4d43ae502a983812192",
    "reviewDate": "Monday, January 6, 2025 at 04:12:36 PM",
    "reviewDateOfExperience": "January 06, 2025",
    "reviewLabel": "",
    "isReviewVerified": false,
    "reviewer": "Simon Cook",
    "reviewTitle": "Absolutely Shocking Customer Service for Refund",
    "reviewDescription": "Our flight was cancelled 12 hours before we were due to fly home on Sunday 8 Dec from Dusseldorf to Heathrow with an alternative flight being offered for the Tuesday! With jobs, children, pets there was no way we could wait to return home 2 1/2 days later! After a very stressful 2 hours trying to rebook flights, we finally managed to book another flight for the Sunday evening but back to Birmingham. We then had to get an Uber home, then catch a train the following evening to collect our car from Heathrow.\n\nAfter all this, I then had to submit a compensation claim to which I was told because they were refunding me for the original return flight, they wouldn't pay for the new flight at a cost of E650!\n\nI am still waiting for the refund for the original flight, after 4 times of chasing, being told that it had been sent to the wrong department, so had to be resent and would take 7-10 business days to now being told that it's still not resolved and I need to wait a few more days. Absolutely shocking customer service from BA. I won't use again!",
    "reviewRatingScore": 1,
    "reviewersCountry": "GB",
    "reviewLanguage": "all",
    "reviewCompanyResponse": "",
    "scrapedDateTime": "2025-01-17T17:49:31.873Z",
    "scrapedAtReviewPageNumber": 5
  },
  {
    "companyPageUrl": "https://www.trustpilot.com/review/www.britishairways.com?languages=English&sort=recency",
    "reviewId": "677bd2c7b6b47acf11c2d3c7",
    "companyName": "British Airways",
    "businessUnitId": "46d2e587000064000500a0e0",
    "reviewUrl": "https://trustpilot.com/reviews/677bd2c7b6b47acf11c2d3c7",
    "reviewDate": "Monday, January 6, 2025 at 02:55:35 PM",
    "reviewDateOfExperience": "January 06, 2025",
    "reviewLabel": "",
    "isReviewVerified": false,
    "reviewer": "EdRM",
    "reviewTitle": "Worse than Ryanair",
    "reviewDescription": "Up there with the worst airlines in the western world. Just a much more expensive Ryanair. Almost always something wrong with the website and don't even think about trying to call the two people they have working on the phonelines. Avoid them at all costs if possible.,",
    "reviewRatingScore": 1,
    "reviewersCountry": "GB",
    "reviewLanguage": "all",
    "reviewCompanyResponse": "",
    "scrapedDateTime": "2025-01-17T17:49:31.976Z",
    "scrapedAtReviewPageNumber": 5
  },
  {
    "companyPageUrl": "https://www.trustpilot.com/review/www.britishairways.com?languages=English&sort=recency",
    "reviewId": "677ba1b7c61ab3de4751b097",
    "companyName": "British Airways",
    "businessUnitId": "46d2e587000064000500a0e0",
    "reviewUrl": "https://trustpilot.com/reviews/677ba1b7c61ab3de4751b097",
    "reviewDate": "Monday, January 6, 2025 at 11:26:15 AM",
    "reviewDateOfExperience": "October 14, 2024",
    "reviewLabel": "",
    "isReviewVerified": false,
    "reviewer": "claudia galluzzi",
    "reviewTitle": "Avoid when possible",
    "reviewDescription": "Used to be a respectable company, is now a joke. My flight was cancelled and rebooked for a full day after, resulting in me missing a morning of meetings in Frankfurt. I received TWO emails from them confirming that it was due to operational issues (not enough operative aircrafts), and this was also all over the news that day. They've now changed their version and say that it was adverse weather, so that they don't have to pay compensation (ooh whoops, silly us for sending you random emails, just discard them). Additionally, it's quite ridiculous that they don't offer included hold luggage when you book long haul. I couldn't be more disappointed in them.",
    "reviewRatingScore": 1,
    "reviewersCountry": "GB",
    "reviewLanguage": "all",
    "reviewCompanyResponse": "",
    "scrapedDateTime": "2025-01-17T17:49:32.080Z",
    "scrapedAtReviewPageNumber": 5
  },
  {
    "companyPageUrl": "https://www.trustpilot.com/review/www.britishairways.com?languages=English&sort=recency",
    "reviewId": "677b00fdf563129ae731efb0",
    "companyName": "British Airways",
    "businessUnitId": "46d2e587000064000500a0e0",
    "reviewUrl": "https://trustpilot.com/reviews/677b00fdf563129ae731efb0",
    "reviewDate": "Monday, January 6, 2025 at 12:00:29 AM",
    "reviewDateOfExperience": "October 11, 2024",
    "reviewLabel": "",
    "isReviewVerified": false,
    "reviewer": "Kayleigh Thomas",
    "reviewTitle": "Overbooked flight",
    "reviewDescription": "Was put on standby due to BA overbooking the flight by 12 people even though I booked 6 months ago. Apparently they do this regularly. After much waiting and stress, was put on the same flight 24hrs later. Had to pay for taxis and food at a nearby hotel with my own money, and missed a day and night of my trip. Had no responses to my complaints. Very disappointed and would not recommend.",
    "reviewRatingScore": 1,
    "reviewersCountry": "GB",
    "reviewLanguage": "all",
    "reviewCompanyResponse": "",
    "scrapedDateTime": "2025-01-17T17:49:32.178Z",
    "scrapedAtReviewPageNumber": 5
  }
]