[
  {
    "companyPageUrl": "https://www.trustpilot.com/review/www.britishairways.com?languages=English&sort=recency",
    "reviewId": "6784efc169de78ae6a3c8ebd",
    "companyName": "British Airways",
    "businessUnitId": "46d2e587000064000500a0e0",
    "reviewUrl": "https://trustpilot.com/reviews/6784efc169de78ae6a3c8ebd",
    "reviewDate": "Monday, January 13, 2025 at 12:49:37 PM",
    "reviewDateOfExperience": "September 12, 2024",
    "reviewLabel": "",
    "isReviewVerified": false,
    "reviewer": "Tilly Heigh",
    "reviewTitle": "Terrible treatment on a business class…",
    "reviewDescription": "Terrible treatment on a business class flight from Washington DC to Heathrow when we were seated separately when the plane type changed and request to change seating at check in and with cabin crew was refused, leaving me distressed (I am a nervous flyer) Compounded by atrocious customer service when we complained. It has taken 4 months and a lot of effort on our part to get a refund for the money paid to choose our seats. Plus when we complained about the treatment by cabin crew and lack of care about my distress we were sent an e-voucher as an \"apology\", and they refused to give cash instead so the apology is empty as we won't be flying with BA again now",
    "reviewRatingScore": 1,
    "reviewersCountry": "GB",
    "reviewLanguage": "all",
    "reviewCompanyResponse": "",
    "scrapedDateTime": "2025-01-17T17:49:01.379Z",
    "scrapedAtReviewPageNumber": 2
  },
  {
    "companyPageUrl": "https://www.trustpilot.com/review/www.britishairways.com?languages=English&sort=recency",
    "reviewId": "6784e36305e693eefde3d7b2",
    "companyName": "British Airways",
    "businessUnitId": "46d2e587000064000500a0e0",
    "reviewUrl": "https://trustpilot.com/reviews/6784e36305e693eefde3d7b2",
    "reviewDate": "Monday, January 13, 2025 at 11:56:51 AM",
    "reviewDateOfExperience": "January 13, 2025",
    "reviewLabel": "",
    "isReviewVerified": false,
    "reviewer": "Mrs Matthews",
    "reviewTitle": "Access to BA customer service",
    "reviewDescription": "I have been trying to obtain a receipt for BA flights taken in Nov/Dec 24 and am getting nowhere. I have raised 2 x cases with BA, the first sat with BA for 3 weeks before being closed without resolution and the second has sat at 'received' for over a week with no progress. Having waited for live chats with a real person the live chats 'mysteriously' have been disconnected forcing me to start all over again.\nMy request for a receipt is pretty simple, if BA cannot get this right I dread to think how the rest of the business is being run.\nI was once a fan of BA but current performance is making it NOT the world's favourite airline!",
    "reviewRatingScore": 1,
    "reviewersCountry": "GB",
    "reviewLanguage": "all",
    "reviewCompanyResponse": "",
    "scrapedDateTime": "2025-01-17T17:49:01.475Z",
    "scrapedAtReviewPageNumber": 2
  },
  {
    "companyPageUrl": "https://www.trustpilot.com/review/www.britishairways.com?languages=English&sort=recency",
    "reviewId": "6784c5f1f532a6239f31d1e4",
    "companyName": "British Airways",
    "businessUnitId": "46d2e587000064000500a0e0",
    "reviewUrl": "https://trustpilot.com/reviews/6784c5f1f532a6239f31d1e4",
    "reviewDate": "Monday, January 13, 2025 at 09:51:13 AM",
    "reviewDateOfExperience": "December 26, 2024",
    "reviewLabel": "",
    "isReviewVerified": false,
    "reviewer": "Peter",
    "reviewTitle": "Came here to write a one star review",
    "reviewDescription": "Came here to write a one star review, and I'm not surprised in the slightest to see a horrifically poor rating for British Airways. It's so low, the kind of low you see for scam websites.\n\nMy first and last experience is due to the fact that they cancelled our flights that were due to depart on Boxing Day. They gave us no alternative carriers that we could fly with. I had to get a refund and fly with a different operator. With it being so much closer to Christmas we had to pay £2000 extra for our flights.\n\nI started a complaint with BA but have been effectively ignored. Completed ghosted. I shall be complaining externally about this terrible organisation but either way, I'll never travel with them again. I hope they go bust.",
    "reviewRatingScore": 1,
    "reviewersCountry": "GB",
    "reviewLanguage": "all",
    "reviewCompanyResponse": "",
    "scrapedDateTime": "2025-01-17T17:49:01.647Z",
    "scrapedAtReviewPageNumber": 2
  },
  {
    "companyPageUrl": "https://www.trustpilot.com/review/www.britishairways.com?languages=English&sort=recency",
    "reviewId": "6783fe08d1b50695f1fe0210",
    "companyName": "British Airways",
    "businessUnitId": "46d2e587000064000500a0e0",
    "reviewUrl": "https://trustpilot.com/reviews/6783fe08d1b50695f1fe0210",
    "reviewDate": "Sunday, January 12, 2025 at 07:38:16 PM",
    "reviewDateOfExperience": "December 09, 2024",
    "reviewLabel": "",
    "isReviewVerified": false,
    "reviewer": "S Stauffer-Kruse",
    "reviewTitle": "No catering on flight in business class",
    "reviewDescription": "We are very frequent travellers on BA with significant status which is why we were somewhat surprised when following there being no catering on our business class flight back to London Heathrow BA did not even respond to us raising a complaint and closed the case without notifying us. I am not quick to complain but this is just the kind of behaviour of a company that will make sure customers will not support them in the future. I may be one of them.",
    "reviewRatingScore": 1,
    "reviewersCountry": "GB",
    "reviewLanguage": "all",
    "reviewCompanyResponse": "",
    "scrapedDateTime": "2025-01-17T17:49:01.762Z",
    "scrapedAtReviewPageNumber": 2
  },
  {
    "companyPageUrl": "https://www.trustpilot.com/review/www.britishairways.com?languages=English&sort=recency",
    "reviewId": "6783f9b8c7c2f5f12bfbe632",
    "companyName": "British Airways",
    "businessUnitId": "46d2e587000064000500a0e0",
    "reviewUrl": "https://trustpilot.com/reviews/6783f9b8c7c2f5f12bfbe632",
    "reviewDate": "Sunday, January 12, 2025 at 08:55:35 PM",
    "reviewDateOfExperience": "December 30, 2024",
    "reviewLabel": "",
    "isReviewVerified": false,
    "reviewer": "Kazza Mc",
    "reviewTitle": "BA reveal themselves as vicious and uncaring",
    "reviewDescription": "I paid £4000+ for one week in Malaga for two people - flights and hotel.\nOriginal flight was cancelled at short notice. The next flight was delayed by over 6 hours with no communication from BA whatsover. The above was only a small part of the problem and can be excused slightly as the weather was to blame.\nHowever, it was our arrival at the hotel and our treatment that I was shocked and dismayed about.\nDue to the delay, we didn't arrive at the hotel until 1am\nWe were told that our whole booking had been cancelled by BA.\nEventually, after paying 690 euros, we were given a tiny noisy room for 1 night and made aware that under no uncertain terms would there be a room available for the rest of the holiday.\nNext morning, after multiple phone calls to BA, we were found a large sea view room, which we had already paid for and lost 2 nights in.\nI requested BA refund for these 2 nights but was gobsmacked to be told - No -\nThey refused further discussion on the matter and to my horror I have since found out they are not ABTA protected.\nIn fact they have no resolution solutions at all. They are a law unto themselves.\nBuyer beware - all is great until there's a hiccup when they will reveal themselves to be the most vicious, money grabbing and uncaring travel company you will ever come across. Do not book unless you can afford to lose a lot of money.\n",
    "reviewRatingScore": 1,
    "reviewersCountry": "GB",
    "reviewLanguage": "all",
    "reviewCompanyResponse": "",
    "scrapedDateTime": "2025-01-17T17:49:01.948Z",
    "scrapedAtReviewPageNumber": 2
  },
  {
    "companyPageUrl": "https://www.trustpilot.com/review/www.britishairways.com?languages=English&sort=recency",
    "reviewId": "6783ea58c7e3cf128446696a",
    "companyName": "British Airways",
    "businessUnitId": "46d2e587000064000500a0e0",
    "reviewUrl": "https://trustpilot.com/reviews/6783ea58c7e3cf128446696a",
    "reviewDate": "Sunday, January 12, 2025 at 06:14:16 PM",
    "reviewDateOfExperience": "November 17, 2024",
    "reviewLabel": "",
    "isReviewVerified": false,
    "reviewer": "M Court",
    "reviewTitle": "This started with a cancelled flight",
    "reviewDescription": "This started with an email stating that my return flight from Barbados had been cancelled. No explanation and no offer of help. The advice was just check their website to rebook or claim a refund. Three weeks before I was supposed to fly out, a refund was of no use due to expensive accommodation bookings. The only flight on offer was 24 hours later. When rebooking, they even made me pay for seat selection again when I had already done this on the original booking. This was later refunded.\nOn my return home I lodged a claim for reimbursement of additional expenses, hotel. food and taxis but the website is not easy to navigate to find out what they pay and how to lodge the claim.\n10 weeks later the status of the claim is simply ''received'' in other words no-one has progressed the claim. 10 weeks of inaction.\nGeneral customer service cannot access the claims process, all they say is that the team are very busy. They cannot provide a contact number to speak to the team so the customer is left entirely frustrated at the complete lack of customer service and accountability.\nLike some of the other contributers, I think I have made my last booking with BA.\n",
    "reviewRatingScore": 1,
    "reviewersCountry": "GB",
    "reviewLanguage": "all",
    "reviewCompanyResponse": "",
    "scrapedDateTime": "2025-01-17T17:49:02.031Z",
    "scrapedAtReviewPageNumber": 2
  },
  {
    "companyPageUrl": "https://www.trustpilot.com/review/www.britishairways.com?languages=English&sort=recency",
    "reviewId": "6783dbb78616bdc32f77d012",
    "companyName": "British Airways",
    "businessUnitId": "46d2e587000064000500a0e0",
    "reviewUrl": "https://trustpilot.com/reviews/6783dbb78616bdc32f77d012",
    "reviewDate": "Sunday, January 12, 2025 at 05:11:51 PM",
    "reviewDateOfExperience": "January 12, 2025",
    "reviewLabel": "",
    "isReviewVerified": false,
    "reviewer": "Ahmad B",
    "reviewTitle": "Like many people said",
    "reviewDescription": "Like many people said, arrogant and extremely rude staff. Not only are they unhelpful and disorganized, but they've reduced their service so much, that they'll leave you stranded anywhere you go. I've taken so many flights with different airlines, and by far this is the worst airline I've ever taken in my life. I'll be giving all your competitors my money, and you won't get a dime out of me.",
    "reviewRatingScore": 1,
    "reviewersCountry": "GB",
    "reviewLanguage": "all",
    "reviewCompanyResponse": "",
    "scrapedDateTime": "2025-01-17T17:49:02.134Z",
    "scrapedAtReviewPageNumber": 2
  },
  {
    "companyPageUrl": "https://www.trustpilot.com/review/www.britishairways.com?languages=English&sort=recency",
    "reviewId": "6783bda22e8525ca5a0ff7bd",
    "companyName": "British Airways",
    "businessUnitId": "46d2e587000064000500a0e0",
    "reviewUrl": "https://trustpilot.com/reviews/6783bda22e8525ca5a0ff7bd",
    "reviewDate": "Sunday, January 12, 2025 at 03:03:30 PM",
    "reviewDateOfExperience": "January 12, 2025",
    "reviewLabel": "",
    "isReviewVerified": false,
    "reviewer": "Owner",
    "reviewTitle": "Dear OWNERS of British Airlines",
    "reviewDescription": "Dear OWNERS of British Airlines\n\nI am writing to express my concerns regarding a recent experience with British Airways that I found to be quite disappointing.\n\nFlight BA 0552 of January 12, 2025\n\nIn my experience, the level of service provided was far below what one would expect from a reputable airline. Specifically, I encountered a significant delay during BA0552 flight, which was exacerbated by a lengthy crew replacement process that took two hours, followed by an additional 1.5 hours for flight attendant replacement.\n\nThroughout this ordeal, I found the staff to be unhelpful and, at times, rude. There was a notable lack of clear and honest communication regarding the reasons for the delay, leaving passengers feeling frustrated and uninformed.\n\nGiven these experiences, I regret to say that I no longer view British Airways as a premium airline. Instead, I perceive it to be more akin to a budget carrier in terms of service quality.\n\nI recommend that potential passengers consider using your airline only in exceptional circumstances.\n\nI would like particularly like to highlight the behaviour of Chief Flight Attendants MR. INCOGNITO who was especially rude and dismissive towards to passengers!\n\nI hope you take this feedback into consideration as you strive to improve your services.\nPassenger Seat 2A\n",
    "reviewRatingScore": 1,
    "reviewersCountry": "GB",
    "reviewLanguage": "all",
    "reviewCompanyResponse": "",
    "scrapedDateTime": "2025-01-17T17:49:02.300Z",
    "scrapedAtReviewPageNumber": 2
  },
  {
    "companyPageUrl": "https://www.trustpilot.com/review/www.britishairways.com?languages=English&sort=recency",
    "reviewId": "6783a9784c0ba734bdda4ea7",
    "companyName": "British Airways",
    "businessUnitId": "46d2e587000064000500a0e0",
    "reviewUrl": "https://trustpilot.com/reviews/6783a9784c0ba734bdda4ea7",
    "reviewDate": "Sunday, January 12, 2025 at 01:37:28 PM",
    "reviewDateOfExperience": "January 12, 2025",
    "reviewLabel": "",
    "isReviewVerified": false,
    "reviewer": "linda",
    "reviewTitle": "Great service",
    "reviewDescription": "Just had the most amazing service from Lindsey, we had to rebook our holiday and she made it so simple for us with lots of patience. Thank you",
    "reviewRatingScore": 5,
    "reviewersCountry": "GB",
    "reviewLanguage": "all",
    "reviewCompanyResponse": "",
    "scrapedDateTime": "2025-01-17T17:49:02.454Z",
    "scrapedAtReviewPageNumber": 2
  },
  {
    "companyPageUrl": "https://www.trustpilot.com/review/www.britishairways.com?languages=English&sort=recency",
    "reviewId": "67837fe0d005648fb302ff77",
    "companyName": "British Airways",
    "businessUnitId": "46d2e587000064000500a0e0",
    "reviewUrl": "https://trustpilot.com/reviews/67837fe0d005648fb302ff77",
    "reviewDate": "Sunday, January 12, 2025 at 10:40:00 AM",
    "reviewDateOfExperience": "January 12, 2025",
    "reviewLabel": "",
    "isReviewVerified": false,
    "reviewer": "Lorna mccarthy",
    "reviewTitle": "Unfriendly food disgusting hardly any…",
    "reviewDescription": "Unfriendly food disgusting hardly any drinks offered on long haul",
    "reviewRatingScore": 1,
    "reviewersCountry": "GB",
    "reviewLanguage": "all",
    "reviewCompanyResponse": "",
    "scrapedDateTime": "2025-01-17T17:49:02.853Z",
    "scrapedAtReviewPageNumber": 2
  },
  {
    "companyPageUrl": "https://www.trustpilot.com/review/www.britishairways.com?languages=English&sort=recency",
    "reviewId": "6782b9d7408ed640c6a3c1f5",
    "companyName": "British Airways",
    "businessUnitId": "46d2e587000064000500a0e0",
    "reviewUrl": "https://trustpilot.com/reviews/6782b9d7408ed640c6a3c1f5",
    "reviewDate": "Saturday, January 11, 2025 at 08:35:03 PM",
    "reviewDateOfExperience": "January 11, 2025",
    "reviewLabel": "",
    "isReviewVerified": false,
    "reviewer": "Christopher Potter",
    "reviewTitle": "BA worst airline in the WORLD!!",
    "reviewDescription": "I want to understand why I can’t rate the as 0. 1 is a huge overrating for this clown company. I was a gold card holder 7 years ago and would only fly BA. Last year they cancelled my return flight whilst on holiday with my whole family with 10 days notice. 6 months later they have just declined our compensation as we had to pay our £2000 for replacement flights, extra nights accommodation, extra day car hire. Their reason: they cancelled the flight for ‘Commercial Reasons’!!!!! So why do I foot the bill for their commercial issues?!?!?! These clowns may think I will leave it here but rest assured I will take this to ombudsman followed by legal firms AND I will be claiming every single penny I am entitled too. I really hope that at some point a Class Action is brought against BA as you can read thousands of similar experiences online and they seem to get away with their inept customer service and ability to stress customers for 6-12 months as I can ill afford £2000 on top of my holiday cost for reasons that an airline simply cancelled my flight and provided no alternative leaving me to book a replacement. The final point of note was that I booked a Vueling flight (which they told me they could not transfer me too as they had no agreement with the airline) AND wait for it, the payment on my statement for that flight went to BRITISH AIRWAYS!!!!!!!!!! 🤡",
    "reviewRatingScore": 1,
    "reviewersCountry": "GB",
    "reviewLanguage": "all",
    "reviewCompanyResponse": "",
    "scrapedDateTime": "2025-01-17T17:49:10.783Z",
    "scrapedAtReviewPageNumber": 3
  },
  {
    "companyPageUrl": "https://www.trustpilot.com/review/www.britishairways.com?languages=English&sort=recency",
    "reviewId": "678293669bdf408306f7f606",
    "companyName": "British Airways",
    "businessUnitId": "46d2e587000064000500a0e0",
    "reviewUrl": "https://trustpilot.com/reviews/678293669bdf408306f7f606",
    "reviewDate": "Sunday, January 12, 2025 at 06:21:37 AM",
    "reviewDateOfExperience": "January 02, 2025",
    "reviewLabel": "",
    "isReviewVerified": false,
    "reviewer": "MRS NEENA SUERGA",
    "reviewTitle": "Very disappointing flight",
    "reviewDescription": "The staff were really arrogant, not friendly and engaging at all, it almost seems as if they just want to get you out of the way feed you and that's it. They did not engage cat all, asked if you wanted o eat and moved on, the male cabin crew that was serving in economy needs customer service training really. I asked for a drink and he said yes he will bring it, waited and waited after 20 minutes asked again from another cabin crew and also was told they will bring it, the flight ended and had still did not get my drink. I was very disappointed. This was my first time flying with British airways have never used him before and I fly at least 5 times a year for both business and lesure. Hope this was a once off and that this was just a bad day for the crew.\nThe food is really horrible especially after spending £1800 on a flight from Heathrow to Johannesburg i expected better much better for an airlines as big as British airways. The dinner i opened had a look and closed it straight away, went hungry and looked forward to breakfast. Then recieved the breakfast and did the same opened and closed it not good at all. A least i managed to eat the fruit.\nThe seat space is really uncomfortable, with theatre table beant the trays were sliding off.\nNot sure if anyone will call me the after care service normally never happens. My flight number was BA57 on 2nd January 2025.\n\nI am flying tonight again 12th January 2025 BA 56 hope his will be different after trying to upgrade my seat to a window seat and not able to, get to the end and dies not allowed me to make a payment and the seat was available. Eventually when I managed the seat was gone. Really disappointing.\n\nThank you\n\n\n\n",
    "reviewRatingScore": 1,
    "reviewersCountry": "GB",
    "reviewLanguage": "all",
    "reviewCompanyResponse": "",
    "scrapedDateTime": "2025-01-17T17:49:10.934Z",
    "scrapedAtReviewPageNumber": 3
  },
  {
    "companyPageUrl": "https://www.trustpilot.com/review/www.britishairways.com?languages=English&sort=recency",
    "reviewId": "67828574c241a708c788adac",
    "companyName": "British Airways",
    "businessUnitId": "46d2e587000064000500a0e0",
    "reviewUrl": "https://trustpilot.com/reviews/67828574c241a708c788adac",
    "reviewDate": "Saturday, January 11, 2025 at 04:51:32 PM",
    "reviewDateOfExperience": "January 11, 2025",
    "reviewLabel": "",
    "isReviewVerified": false,
    "reviewer": "Andre Bothma",
    "reviewTitle": "Poor customer service",
    "reviewDescription": "I spent a considerable amount of time on the phone attempting to resolve a booking for my family holiday. Over the course of four separate occasions, I had to speak with four different members of staff, each time enduring a queue of over 40 minutes.\n\nWhat I found particularly frustrating was that each representative provided entirely different costs and calculations, despite being given the same points and voucher information.\n\nMoreover, I found the tone and attitude of the staff to be unacceptably arrogant, even though I made every effort to remain polite throughout the interactions.\n\nIn contrast, when I contacted Virgin Atlantic, I was thoroughly impressed with how professionally and efficiently they handled my calls. Their customer service was exemplary, and their offerings were notably more competitive compared to British Airways.\n\n",
    "reviewRatingScore": 1,
    "reviewersCountry": "GB",
    "reviewLanguage": "all",
    "reviewCompanyResponse": "",
    "scrapedDateTime": "2025-01-17T17:49:11.087Z",
    "scrapedAtReviewPageNumber": 3
  },
  {
    "companyPageUrl": "https://www.trustpilot.com/review/www.britishairways.com?languages=English&sort=recency",
    "reviewId": "67828178d93e77a0f5288875",
    "companyName": "British Airways",
    "businessUnitId": "46d2e587000064000500a0e0",
    "reviewUrl": "https://trustpilot.com/reviews/67828178d93e77a0f5288875",
    "reviewDate": "Saturday, January 11, 2025 at 04:34:32 PM",
    "reviewDateOfExperience": "January 02, 2025",
    "reviewLabel": "",
    "isReviewVerified": false,
    "reviewer": "Mrs Eastman",
    "reviewTitle": "They get such a slating but I actually like them and recently had a great experience with them",
    "reviewDescription": "Much improved",
    "reviewRatingScore": 5,
    "reviewersCountry": "GB",
    "reviewLanguage": "all",
    "reviewCompanyResponse": "",
    "scrapedDateTime": "2025-01-17T17:49:11.279Z",
    "scrapedAtReviewPageNumber": 3
  },
  {
    "companyPageUrl": "https://www.trustpilot.com/review/www.britishairways.com?languages=English&sort=recency",
    "reviewId": "67822ac98640a1117b67f0c0",
    "companyName": "British Airways",
    "businessUnitId": "46d2e587000064000500a0e0",
    "reviewUrl": "https://trustpilot.com/reviews/67822ac98640a1117b67f0c0",
    "reviewDate": "Saturday, January 11, 2025 at 10:24:41 AM",
    "reviewDateOfExperience": "March 13, 2024",
    "reviewLabel": "",
    "isReviewVerified": false,
    "reviewer": "Debs X",
    "reviewTitle": "HORRIBLE CUSTOMER SERVICE",
    "reviewDescription": "Had a decent flight with them in the past, I placed a booking that I cancelled and they sent the refund to the wrong account. I chased them for 4-5 MONTHS! I was being mis informed, gaslit and lied to just kept being ansked to wait annd they would anssure me it would be resolved, I wait annd call back annd it’s an different story. absolutely horrible customer service. How in one phone call I’m getting told 3 different things. I was even told I would get a call back from a manager on 3 occasions, I was the one calling this company. I called around 20 times in total only to find out I’m being gaslit the entire time. I filed a complaint on their website and all they do is offer me £50 voucher? Wtf am I gonna do with that when my flight was £300. British airways can sk itself sideways.",
    "reviewRatingScore": 1,
    "reviewersCountry": "GB",
    "reviewLanguage": "all",
    "reviewCompanyResponse": "",
    "scrapedDateTime": "2025-01-17T17:49:11.465Z",
    "scrapedAtReviewPageNumber": 3
  },
  {
    "companyPageUrl": "https://www.trustpilot.com/review/www.britishairways.com?languages=English&sort=recency",
    "reviewId": "6781ce9b80b64287a6035eb4",
    "companyName": "British Airways",
    "businessUnitId": "46d2e587000064000500a0e0",
    "reviewUrl": "https://trustpilot.com/reviews/6781ce9b80b64287a6035eb4",
    "reviewDate": "Saturday, January 11, 2025 at 03:51:23 AM",
    "reviewDateOfExperience": "January 04, 2025",
    "reviewLabel": "",
    "isReviewVerified": false,
    "reviewer": "J May",
    "reviewTitle": "Such arrogant staff and poor service all in all",
    "reviewDescription": "LON -SFO\nSFO-LON\nSuch arrogant and poor service from a career never seen before. Some of the Senior staff are obnoxious and make unwanted comments. Looks like there is no monitoring of their services or behaviour. Food was poor and inadequate, and so were the facilities and entertainment for a long-haul flight. Budget airlines would do a better job. At the end of the journey, we wanted to find something positive to write. But there wasn't anything.",
    "reviewRatingScore": 1,
    "reviewersCountry": "GB",
    "reviewLanguage": "all",
    "reviewCompanyResponse": "",
    "scrapedDateTime": "2025-01-17T17:49:11.597Z",
    "scrapedAtReviewPageNumber": 3
  },
  {
    "companyPageUrl": "https://www.trustpilot.com/review/www.britishairways.com?languages=English&sort=recency",
    "reviewId": "678187733300519128215a0d",
    "companyName": "British Airways",
    "businessUnitId": "46d2e587000064000500a0e0",
    "reviewUrl": "https://trustpilot.com/reviews/678187733300519128215a0d",
    "reviewDate": "Friday, January 10, 2025 at 10:47:47 PM",
    "reviewDateOfExperience": "January 08, 2025",
    "reviewLabel": "",
    "isReviewVerified": true,
    "reviewer": "Patrick Gilman",
    "reviewTitle": "Possibly the Worst Website a Mediocre Airline Ever Had",
    "reviewDescription": "Following a grueling journey from EDI to AKL and back again during which time my checked bag was lost twice I cannot reccomend this airline.\n\nRegarding the airline itself, none of the four flights I took with them (half of which were over 8 hours in length) were on time. The first was over an hour late resulting in me being rebooked The second (which left before I arrived, but somehow carried one of my bags?) was an hour earlier than when I booked it. The third, due to a broken groundside air conditioner was also delayed, much of which saw me sweating my trecherous life away on a sweltering plane, that were it to just take off would be so much colder. The final flight was also a tad early, and was also missed due to a couple hours of delay.\n\nBeyond this, they lost my bag. Their website was repeatedly down due to \"high demandm,\" generally sluggish, and the section for tracking my bag was hidden through several confusingly titled links.\n\nBritish Airways desperately needs to get their act together, I have had worse experiences flying, but not many.\n\n",
    "reviewRatingScore": 1,
    "reviewersCountry": "GB",
    "reviewLanguage": "all",
    "reviewCompanyResponse": "",
    "scrapedDateTime": "2025-01-17T17:49:11.762Z",
    "scrapedAtReviewPageNumber": 3
  },
  {
    "companyPageUrl": "https://www.trustpilot.com/review/www.britishairways.com?languages=English&sort=recency",
    "reviewId": "678182d6517e7c412c987752",
    "companyName": "British Airways",
    "businessUnitId": "46d2e587000064000500a0e0",
    "reviewUrl": "https://trustpilot.com/reviews/678182d6517e7c412c987752",
    "reviewDate": "Friday, January 10, 2025 at 10:28:06 PM",
    "reviewDateOfExperience": "December 28, 2024",
    "reviewLabel": "",
    "isReviewVerified": false,
    "reviewer": "Mrs J",
    "reviewTitle": "Efficient helpful professional airline",
    "reviewDescription": "Booked my trip to Australia\nAurlijecused Qatar also\nBusiness class\nGreat booking\nAnd customer service desk at Sydney airport went above and beyond to support me with a flight change x\nWill definitely fly BA in future",
    "reviewRatingScore": 5,
    "reviewersCountry": "GB",
    "reviewLanguage": "all",
    "reviewCompanyResponse": "",
    "scrapedDateTime": "2025-01-17T17:49:11.846Z",
    "scrapedAtReviewPageNumber": 3
  },
  {
    "companyPageUrl": "https://www.trustpilot.com/review/www.britishairways.com?languages=English&sort=recency",
    "reviewId": "6781453e7811ef3335b65430",
    "companyName": "British Airways",
    "businessUnitId": "46d2e587000064000500a0e0",
    "reviewUrl": "https://trustpilot.com/reviews/6781453e7811ef3335b65430",
    "reviewDate": "Friday, January 10, 2025 at 06:05:18 PM",
    "reviewDateOfExperience": "January 10, 2025",
    "reviewLabel": "",
    "isReviewVerified": false,
    "reviewer": "John Hayes",
    "reviewTitle": "Don’t fly Ba you will never get onward taxi transport",
    "reviewDescription": "Woke up this morning to collect my clients to take to Heathrow however the flight to Austin was cancelled yesterday but my clients didn’t know until 5 this morning so I’m £150 down typical of BA next time someone tries to book a car to take them to Heathrow il refuse I hope every other cab company do the same passengers and customers will refuse to accept bookings if they fly BA",
    "reviewRatingScore": 1,
    "reviewersCountry": "GB",
    "reviewLanguage": "all",
    "reviewCompanyResponse": "",
    "scrapedDateTime": "2025-01-17T17:49:12.145Z",
    "scrapedAtReviewPageNumber": 3
  },
  {
    "companyPageUrl": "https://www.trustpilot.com/review/www.britishairways.com?languages=English&sort=recency",
    "reviewId": "67812e6788fbc7a3b9e9d018",
    "companyName": "British Airways",
    "businessUnitId": "46d2e587000064000500a0e0",
    "reviewUrl": "https://trustpilot.com/reviews/67812e6788fbc7a3b9e9d018",
    "reviewDate": "Friday, January 10, 2025 at 04:27:51 PM",
    "reviewDateOfExperience": "January 08, 2025",
    "reviewLabel": "",
    "isReviewVerified": false,
    "reviewer": "Andrew",
    "reviewTitle": "Gobsmackingly inept company",
    "reviewDescription": "Gobsmackingly inept company. Left an item on the plane to NYC JFK. The BA website says contact the airport. The airport says call the BA number at the airport. Two days later and no answer. The BA website complaints form doesn’t work. Tried on three different devices and a complaint can’t be submitted. Yes the plane flew, and yes we didn’t die. But surely other parts of the service matter LIKE ANSWERING YOUR PHONE. Avoid BA like the plague.",
    "reviewRatingScore": 1,
    "reviewersCountry": "GB",
    "reviewLanguage": "all",
    "reviewCompanyResponse": "",
    "scrapedDateTime": "2025-01-17T17:49:12.261Z",
    "scrapedAtReviewPageNumber": 3
  }
]