[
  {
    "companyPageUrl": "https://www.trustpilot.com/review/www.britishairways.com?languages=English&sort=recency",
    "reviewId": "678a6c80f779edb111d4d6ac",
    "companyName": "British Airways",
    "businessUnitId": "46d2e587000064000500a0e0",
    "reviewUrl": "https://trustpilot.com/reviews/678a6c80f779edb111d4d6ac",
    "reviewDate": "Friday, January 17, 2025 at 04:43:12 PM",
    "reviewDateOfExperience": "January 17, 2025",
    "reviewLabel": "",
    "isReviewVerified": false,
    "reviewer": "Lex Zard",
    "reviewTitle": "Absolutely horrible",
    "reviewDescription": "Absolutely horrible, from the prices, to the planes, to the customer service... the only functioning person in this company is the guy who flights the plane.",
    "reviewRatingScore": 1,
    "reviewersCountry": "GB",
    "reviewLanguage": "all",
    "reviewCompanyResponse": "",
    "scrapedDateTime": "2025-01-17T17:48:48.653Z",
    "scrapedAtReviewPageNumber": 1
  },
  {
    "companyPageUrl": "https://www.trustpilot.com/review/www.britishairways.com?languages=English&sort=recency",
    "reviewId": "678a5a263aedf44a72349755",
    "companyName": "British Airways",
    "businessUnitId": "46d2e587000064000500a0e0",
    "reviewUrl": "https://trustpilot.com/reviews/678a5a263aedf44a72349755",
    "reviewDate": "Friday, January 17, 2025 at 03:24:54 PM",
    "reviewDateOfExperience": "June 21, 2024",
    "reviewLabel": "",
    "isReviewVerified": false,
    "reviewer": "Margaret Stryjewski",
    "reviewTitle": "BA YOU SHOULD BE ASHAMED OF YOURSELVES",
    "reviewDescription": "We flew from Edinburgh to London Heathrow and connected from London Heathrow to Rome. Got on the plane at Edinburgh and two people decided that they didn’t want to fly. Delayed whilst they got their cases off. The conveyor belt broke down whilst they were doing this. Waited on an engineer coming eventually arrived fixed that we missed our slot. Eventually arrived into Heathrow and met at the gate given a ticket to say our next flight was at 7pm given a £10 meal voucher with a 7 hour delay ahead of us, wouldn’t even buy you a sandwich and a drink. Told to go to customer services. There was an earlier flight at 2pm ish we asked if we couldn’t get on? My son looked on line and we could buy 4 tickets on that flight despite being told there was no seats and showing the lady the flights on his phone. Told we should go to the gate at that time and they would see what they could do, we never got on. Our original flight from Edinburgh was 8.05 arrive London Heathrow 9.35 leave Heathrow 11.50 arrive Rome 15.25. So over two hours between flights. This happened on the 21st June, they did eventually after several emails back and forth with my son who claimed for 4 of us. They admitted they were liable for compensation this was 11th January 2025 and asked for my sons bank details. He sent them and reminded them that there was 4 of us. They then emailed back to say they weren’t paying compensation we had plenty of time to catch our flight and all they would pay was the extra taxi fare we had to get. It was after midnight when we eventually arrived in Rome. To say BA are one of the best airlines to travel with and this is the shoddy treatment we have received is beyond me. You can’t speak to anyone, I think nearly an 8 month wait is unreasonable and BA should be ashamed of themselves. I personally think your just going to get fed up and go away!! Well I can tell you BA we are NOT going away and we will continue to fight for what we are owed.",
    "reviewRatingScore": 1,
    "reviewersCountry": "GB",
    "reviewLanguage": "all",
    "reviewCompanyResponse": "",
    "scrapedDateTime": "2025-01-17T17:48:48.790Z",
    "scrapedAtReviewPageNumber": 1
  },
  {
    "companyPageUrl": "https://www.trustpilot.com/review/www.britishairways.com?languages=English&sort=recency",
    "reviewId": "67894616e139fbf5a66fb938",
    "companyName": "British Airways",
    "businessUnitId": "46d2e587000064000500a0e0",
    "reviewUrl": "https://trustpilot.com/reviews/67894616e139fbf5a66fb938",
    "reviewDate": "Thursday, January 16, 2025 at 07:47:02 PM",
    "reviewDateOfExperience": "January 16, 2025",
    "reviewLabel": "",
    "isReviewVerified": false,
    "reviewer": "Ann Cozens",
    "reviewTitle": "BRITISH AIRWAYS AWFUL SERVICE",
    "reviewDescription": "I have Been flying with British Airways for many years.\n\nLast September, I flew to Atlanta to visit my sister and because I have bad knees I paid for a seat upgrade so that I would have more legroom, Before my flight. I was told I could no longer have the seats, they didn’t explain why just put me into a regular seat with poor legroom, I was informed that I could claim my money back once I had returned to the UK.\n\nI put in my claim when I returned in October 2024, and received an email giving me a case number and telling me that it will be dealt with as soon as possible. I have now been waiting almost 3 months for my money back, I’ve contacted them on numerous occasions only to be told that it’s in a queue And that I can’t speak to the relevant department who deals with this. Today, I tried using the chat line who couldn’t understand a word I was saying as it’s obviously a robot. I spent 25 minutes trying to get my point across with no help whatsoever and I can’t find a telephone number where I can talk to the relevant people dealing with my claim. VERY POOR SERVICE!",
    "reviewRatingScore": 1,
    "reviewersCountry": "GB",
    "reviewLanguage": "all",
    "reviewCompanyResponse": "",
    "scrapedDateTime": "2025-01-17T17:48:48.977Z",
    "scrapedAtReviewPageNumber": 1
  },
  {
    "companyPageUrl": "https://www.trustpilot.com/review/www.britishairways.com?languages=English&sort=recency",
    "reviewId": "67892b66300a6ff43344afde",
    "companyName": "British Airways",
    "businessUnitId": "46d2e587000064000500a0e0",
    "reviewUrl": "https://trustpilot.com/reviews/67892b66300a6ff43344afde",
    "reviewDate": "Thursday, January 16, 2025 at 05:53:10 PM",
    "reviewDateOfExperience": "November 17, 2024",
    "reviewLabel": "",
    "isReviewVerified": false,
    "reviewer": "delia rosenboom",
    "reviewTitle": "British Airways happy to 'steal' from customers! Appalling treatment!",
    "reviewDescription": "I am appalled at the despicable way in which British Airways have behaved! I am absolutely angry, upset, frustrated and fed up with the seeming impossibility and inability of BA staff to arrange for me to book a seat for a cello alongside a passenger! They have effectively stolen £76 from me and are refusing to refund this! I have been waiting to be contacted by a manager, since mid- November and have now given up, hence posting this review!\nBA's procedure for booking a cello seat is TOTALLY RIDICULOUS and near impossible:\nOn 13th November 2024 I called BA to book a seat for my son and a seat for his cello, to travel from UK to Austria. I have booked seats twice before with BA and know from these experiences that rather than simply booking two seats online (as with any other airline he has travelled with!) that BA require that a cello seat has to be booked separately to the passenger seat, via a phone call.\nWhen I called to book a seat for the cello, I was first told I could simply book 2 seats via the BA website. I was very surprised and asked the staff member if this was correct. I was told this was the case, and felt relieved that BA must have changed their rules. However I decided to check...... I googled BA’s website and discovered that this information was in fact incorrect. When I mentioned this, the staff member first disagreed...and then checked.. and told me that I did in fact need to book the cello seat on the phone!! It was very surprising that this person did not know the rules and had I not known this from previous experience, I would have bought an incorrect ticket which apparently would not have been accepted at the airport!\nI was then told I needed to book a seat for my son first, and that once I had a reference number, to call back to arrange for a seat for the cello. I did this and I used a BA voucher to pay for the flight for my son: Booking JRQEJZ.\nWhen I called back to ask for the additional seat, I was told that a form had to first be submitted to apply for the seat. I made it very clear that we definitely needed a seat for the cello as it was not allowed legally, for this cello to be placed in the hold. The staff member then said they had submitted the form and that I would be contacted by email a day or two later, and should at that point call back to pay for the seat.\nTwo days later, on 15th Nov I received and email asking me to contact BA about my booking. I called back only to be told that the form had somehow not been properly submitted and needed to be submitted again, I was again told to call back 24 to 48 hours later. I called again on 16th and was told there was still no decision about the cello seat and that I should call again in 24-72 hours. My son was due to fly in LESS than 72 hours and this felt like an impossible situation!!!!\nThe staff members that I spoke to did not seem at all sympathetic, caring, or even concerned that I had spent four days, not to mention many, many hours of being on hold, that I was getting nowhere and still did not know if the seat would be granted or not!! Their entire attitude was as if they didn’t care at all about their customers!!\nAgain, I called back a day later – 17th Nov in the evening and at that point was told that my son could not have a seat for the cello but would have to book it into the hold, despite me having expressly stated that this was not safe for an old cello and also was not legally allowed for his instrument to go in the hold!!! I stated that I knew it was possible to take the cello on a seat, as we had done this on two previous occasions without problem, however, I was simply repeatedly told that cellos cannot go on seats and must go into the hold. If this is the case, why was I not told this? It makes no sense, as on BA’s website it states:\n“Your cello can travel next to you in the cabin in an additional seat. You’ll need to buy this seat specifically for your cello when you book your flight, or at least 48 hours before you travel, subject to availability.\nAt this point, I had only a few hours to find a new flight for my son and his cello, in order that he could return on 18th. I was also in the position of having purchased a seat for my son for £76, which I ONLY purchased because I was told by BA staff that in order to apply for a cello seat, I HAD TO 1ST PURCHASE A SEAT and obtain a booking reference number!!! I would never have purchased this seat if I had known from the start that they were to refuse the cello!!! When I asked for this cost to be refunded I was repeatedly told that this was not possible! I consider this akin to stealing this money from me!! I then spoke with Swalia, a manager who said she would look into this for me and contact me. I am still waiting and have heard nothing. I am beyond upset and consider that BA not only do not care about their customers, but are happy to steal from them!\nThey obviously do not want to have musicians travel with them.\nAvoid at all costs!",
    "reviewRatingScore": 1,
    "reviewersCountry": "GB",
    "reviewLanguage": "all",
    "reviewCompanyResponse": "",
    "scrapedDateTime": "2025-01-17T17:48:49.147Z",
    "scrapedAtReviewPageNumber": 1
  },
  {
    "companyPageUrl": "https://www.trustpilot.com/review/www.britishairways.com?languages=English&sort=recency",
    "reviewId": "678927cf8111c939e8e3d48b",
    "companyName": "British Airways",
    "businessUnitId": "46d2e587000064000500a0e0",
    "reviewUrl": "https://trustpilot.com/reviews/678927cf8111c939e8e3d48b",
    "reviewDate": "Thursday, January 16, 2025 at 05:37:51 PM",
    "reviewDateOfExperience": "January 06, 2025",
    "reviewLabel": "",
    "isReviewVerified": false,
    "reviewer": "Graeme Dawson",
    "reviewTitle": "DO NOT FLY WITH BA!",
    "reviewDescription": "During a period of poor weather 6th Jan 2025 ( this is me being generous ) - although the flight was not disrupted - I flew from NCL to LHR arriving on time and made my way to the baggage reclaim hall in T5.\n\nI had made sure that I had sufficient time to catch my connecting flight from T2, which I fly regularly each month, upon arrival I was forced to wait 2 1/2 hours for my bags to come from the carousel.\n\nI approached the baggage service desk and was told that we are busy, it's very busy and nothing can be done.\n\nI made my way to T2 after eventually getting my bag but I had missed my connection, I had to book an alternative flight to reach my destination, book a hotel for the night, feed myself and travel to and from the hotel I had to book all because because of BA I had missed my connecting flight.\n\nI was dismissed from BA service desk as \"they couldn't help me because I wasn't flying with a partner airline\" and upon contacting them through their complaints/claims channel I have not received any response whatsoever!\n\nAbsolutely atrocious customer experience!",
    "reviewRatingScore": 1,
    "reviewersCountry": "GB",
    "reviewLanguage": "all",
    "reviewCompanyResponse": "",
    "scrapedDateTime": "2025-01-17T17:48:49.270Z",
    "scrapedAtReviewPageNumber": 1
  }
]